
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_storage_project_service_account.gcs_account: Reading...
data.google_project.project: Reading...
google_service_account.cloud_run_sa: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/budget-service@rising-sector-360922.iam.gserviceaccount.com]
google_storage_bucket.budget_data_bucket: Refreshing state... [id=budget-data]
google_bigquery_dataset.budgets_dataset: Refreshing state... [id=projects/rising-sector-360922/datasets/budgets]
google_project_iam_member.event_receiver_member: Refreshing state... [id=rising-sector-360922/roles/eventarc.eventReceiver/serviceAccount:budget-service@rising-sector-360922.iam.gserviceaccount.com]
google_cloud_run_v2_service.budget: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/services/budget-categorise]
data.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-950322501036@gs-project-accounts.iam.gserviceaccount.com]
google_project_iam_member.gcs_pubsub_member: Refreshing state... [id=rising-sector-360922/roles/pubsub.publisher/serviceAccount:service-950322501036@gs-project-accounts.iam.gserviceaccount.com]
data.google_project.project: Read complete after 0s [id=projects/rising-sector-360922]
google_bigquery_table.budget_external_table: Refreshing state... [id=projects/rising-sector-360922/datasets/budgets/tables/budgets]
google_eventarc_trigger.trigger_bucket: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/triggers/trigger-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service_iam_member.run_invoker_member will be created
  + resource "google_cloud_run_v2_service_iam_member" "run_invoker_member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = (known after apply)
      + name     = "budget-categorise"
      + project  = "rising-sector-360922"
      + role     = "roles/run.invoker"
    }

  # google_eventarc_trigger.trigger_bucket will be updated in-place
  ~ resource "google_eventarc_trigger" "trigger_bucket" {
        id              = "projects/rising-sector-360922/locations/us-central1/triggers/trigger-bucket"
        name            = "trigger-bucket"
      ~ service_account = "budget-service@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # google_service_account.eventarc_sa will be created
  + resource "google_service_account" "eventarc_sa" {
      + account_id = "eventarc"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "rising-sector-360922"
      + unique_id  = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Wallace99, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Deploy`*